<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/twocanoes/xcreds</string>
	<key>pfm_description</key>
	<string>XCreds 5.7 (9010) OAuth Settings</string>
	<key>pfm_documentation_url</key>
	<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
	<key>pfm_domain</key>
	<string>com.twocanoes.xcreds</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2025-10-24T20:27:15Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures XCreds configuration preferences</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>XCreds</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.twocanoes.xcreds</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.twocanoes.xcreds</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The desired AD domain</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>ADDomain</string>
			<key>pfm_title</key>
			<string>ADDomain</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The OIDC claim that has the kerberos principal name. This is used when logging in with OIDC and ADDomain is defined. During login, the claim that contains the kerberos principal name will be read and the local account will set dsAttrTypeNative:_xcreds_activedirectory_kerberosPrincipal to the kerberos principal name. The menu item will then use this value and the password to get a kerberos ticket.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>mapKerberosPrincipalName</string>
			<key>pfm_title</key>
			<string>Map Kerberos Principal Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If the user principal has a domain name and the OpenID token does not match the ADDomain name, replace it with the ADDomain name. For example: bob@sub.example.com -&gt; bob@example.com if ADDomain was example.com.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldUpdateKerberosUserPrincipalADDomain</string>
			<key>pfm_title</key>
			<string>Should Update Kerberos User Principal ADDomain</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The OIDC client id public identifier for the app.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>clientID</string>
			<key>pfm_title</key>
			<string>Client ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Client Secret sometimes required by identity provider.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>clientSecret</string>
			<key>pfm_title</key>
			<string>Client Secret</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When set to true and the user account is created, the user will be a local admin.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>CreateAdminUser</string>
			<key>pfm_title</key>
			<string>Create User as Admin</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.5</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When set to true and a new user home is created, the .skipbuddy file will be created at the top of the home folder to skip user setup screens.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>skipUserSetupBuddy</string>
			<key>pfm_title</key>
			<string>Skip User Setup Buddy</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_default</key>
			<string>upn</string>
			<key>pfm_description</key>
			<string>The claim that contains the value to check for in the allowedUsersArray. Both must be defined.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>allowUsersClaim</string>
			<key>pfm_title</key>
			<string>Allow Users Claim</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_description</key>
			<string>List of users that are allowed to log in. An empty array or undefined array means any user can log in as long their cloud credentials are valid. The preference allowUsersClaim must be defined to a claim in the idToken that identifies the users. For example, if the allowUsersClaim is set to upn and the allowedUsersArray is set to an array that contains fred@twocanoes.com and the upn of a logging in user is fred@twocanoes.com, they would be allowed to log in. barney@twocanoes.com would not.</string>
			<key>pfm_name</key>
			<string>allowedUsersArray</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>user</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allowed Users</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_description</key>
			<string>(OIDC Only) List of groups whose members should be allowed to login. If the user is a member of any of these groups they can login regardless (including creating new local account) if authorization succeeds. If a local account exists but the user is no longer part of a group the login will be denied.</string>
			<key>pfm_name</key>
			<string>allowLoginIfMemberOfGroup</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>group</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow Login If Member Of Group</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>List of groups that should have members be given local administrator status. Local administrator status can be given on first authentication when account created, or on later sign in of existing user when a group member. Administrator status is removed if group membership later revoked. Administrator status is not removed if user is the only XCreds admin user. Set as an Array of Strings of the group identifier.</string>
			<key>pfm_name</key>
			<string>CreateAdminIfGroupMember</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>group</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Create Admin If Group Member</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_description</key>
			<string>List of claims that should be added to the user local account. Will be prefixed with _xcreds_oidc_. Set as an Array of Strings of the claim.</string>
			<key>pfm_name</key>
			<string>claimsToAddToLocalUserAccount</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>claim</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Claims To Add To Local User Account</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.1</string>
			<key>pfm_description</key>
			<string>Items to be added to the System Info Popover at login. Can be made dynamic by using the override script override to provide this setting</string>
			<key>pfm_name</key>
			<string>systemInfoAdditionsArray</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>item</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>System Info Additions</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When set to true and the user locks the current session, XCreds will tell the system to switch to Login Window. The current session will stay active but the user will login with the XCreds Login Window to resume the session.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldSwitchToLoginWindowWhenLocked</string>
			<key>pfm_title</key>
			<string>Should Switch To Login Window When Locked</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If the user attempts to login as an AD user and the login fails against AD, try against local user account if off domain or AD user not found.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>LocalFallback</string>
			<key>pfm_title</key>
			<string>LocalFallback</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.1</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show the system info popover as active when first starting</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldActivateSystemInfoButton</string>
			<key>pfm_title</key>
			<string>Should Activate System Info Button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>https://login.microsoftonline.com/common/.well-known/openid-configuration</string>
			<key>pfm_description</key>
			<string>The discovery URL provided by your OIDC / Cloud provider. For Google it is typically https://accounts.google.com/.well-known/openid-configuration and for Azure it is typically https://login.microsoftonline.com/common/.well-known/openid-configuration.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>discoveryURL</string>
			<key>pfm_title</key>
			<string>Discovery URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enabled FDE enabled at first login on APFS disks.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>EnableFDE</string>
			<key>pfm_title</key>
			<string>Enable Full Disk Encryption (FDE)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Save the Personal Recovery Key (PRK) to disk for the MDM Escrow Service to collect.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>EnableFDERecoveryKey</string>
			<key>pfm_title</key>
			<string>Save PRK</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specify a custom path for the recovery key.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>EnableFDERecoveryKeyPath</string>
			<key>pfm_title</key>
			<string>FDE Recovery Key Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Rotate the Personal Recovery Key (PRK).</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>EnableFDERekey</string>
			<key>pfm_title</key>
			<string>Enable FDE Rekey</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Login Window webview width (Integer). If this is not defined, it will be full width. Minimum value of 150.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>loginWindowWidth</string>
			<key>pfm_range_min</key>
			<integer>150</integer>
			<key>pfm_title</key>
			<string>Login Window Width</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Login Window webview height (Integer). If this is not defined, it will be full height. Minimum value of 150.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>loginWindowHeight</string>
			<key>pfm_range_min</key>
			<integer>150</integer>
			<key>pfm_title</key>
			<string>Login Window Height</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_default</key>
			<string>Please Wait....</string>
			<key>pfm_description</key>
			<string>When no network connection or a profile is not defined, this title is shown in an HTML view to the user when cloud login is configured.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>loadPageTitle</string>
			<key>pfm_title</key>
			<string>LoadPage Title</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_default</key>
			<string>(or try connecting to network or check preferences)</string>
			<key>pfm_description</key>
			<string>When no network connection or a profile is not defined, this text is shown in an HTML view to the user when cloud login is configured.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>loadPageInfo</string>
			<key>pfm_title</key>
			<string>LoadPage Info</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.4</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Hide the login window logo.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldHideLoginWindowLogo</string>
			<key>pfm_title</key>
			<string>should Hide Login Window Logo</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_description</key>
			<string>URL to an image to show icon in the username / password login window</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_format</key>
			<string>(https?://|file:///).*</string>
			<key>pfm_name</key>
			<string>loginWindowLogoPath</string>
			<key>pfm_title</key>
			<string>Login Window Logo Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>file:///System/Library/CoreServices/DefaultDesktop.heic</string>
			<key>pfm_description</key>
			<string>URL to an image to show in the background while logging in. Default value: file:///System/Library/Desktop Pictures/Monterey Graphic.heic.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_format</key>
			<string>(https?://|file:///).*</string>
			<key>pfm_name</key>
			<string>loginWindowBackgroundImageURL</string>
			<key>pfm_title</key>
			<string>Login Window Background Image URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<real>1</real>
			<key>pfm_description</key>
			<string>Alpha value of loginWindowBackgroundImage. Default value: 1</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>loginWindowBackgroundImageAlpha</string>
			<key>pfm_range_max</key>
			<integer>1</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Login Window Background Image Alpha</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<string>file:///System/Library/CoreServices/DefaultDesktop.heic</string>
			<key>pfm_description</key>
			<string>URL to an image to show in the background on secondary display while logging in. Default value: file:///System/Library/Desktop Pictures/Monterey Graphic.heic.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_format</key>
			<string>(https?://|file:///).*</string>
			<key>pfm_name</key>
			<string>loginWindowSecondaryMonitorsBackgroundImageURL</string>
			<key>pfm_title</key>
			<string>Login Window Secondary Monitors Background Image URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_description</key>
			<string>Base64 data of icon. Should be 48 x 48.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>menuItemIconData</string>
			<key>pfm_title</key>
			<string>Menu Item Icon Data</string>
			<key>pfm_type</key>
			<string>data</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_description</key>
			<string>Base64 data of icon with checkmark. Should be 48 x 48.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>menuItemIconCheckedData</string>
			<key>pfm_title</key>
			<string>Menu Item Icon Checked Data</string>
			<key>pfm_type</key>
			<string>data</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>URL to an image to show in the background of the window that appears when logged in and prompting for Active Directory username and password.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_format</key>
			<string>(https?://|file:///).*</string>
			<key>pfm_name</key>
			<string>menuItemWindowBackgroundImageURL</string>
			<key>pfm_title</key>
			<string>Menu Item Window BackgroundImageURL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<real>1</real>
			<key>pfm_description</key>
			<string>Alpha value of menuItemWindowBackgroundImageURL. Default value: 1</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>menuItemWindowBackgroundImageAlpha</string>
			<key>pfm_range_max</key>
			<integer>1</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Menu Item Background Image Alpha</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set the background image to Fill Screen rather than Fit to Screen</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldLoginWindowBackgroundImageFillScreen</string>
			<key>pfm_title</key>
			<string>Login Window Background Image Fill Screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set the secondary monitor(s) background image to Fill Screen rather than Fit to Screen</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldLoginWindowSecondaryMonitorsBackgroundImageFillScreen</string>
			<key>pfm_title</key>
			<string>Login Window Secondary Monitors Background Image Fill Screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<real>1</real>
			<key>pfm_description</key>
			<string>Alpha value of loginWindowSecondaryMonitorsBackground. Default value: 1</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>loginWindowSecondaryMonitorsBackgroundAlpha</string>
			<key>pfm_range_max</key>
			<integer>1</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Login Window Secondary Monitors Background Image Alpha</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When XCreds is installed, a launch agent is installed to automatically keep the menu item running when a user is logged in. Setting shouldRemoveMenuItemAutoLaunch to true makes XCreds at the login window remove the launchagent plist that was installed. This will cause the launchagent to not launch XCreds menu item on log in.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldRemoveMenuItemAutoLaunch</string>
			<key>pfm_title</key>
			<string>Should Remove Menu Item Auto Launch</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.4</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When changing password via menu item, use the native UI to change password in Active Directory.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldUseADNativePasswordChangeMenuItem</string>
			<key>pfm_title</key>
			<string>Should Use AD Native Password Change Menu Item</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Add a menu item for changing the password that will open this URL when the menu item is selected. If shouldUseADNativePasswordChangeMenuItem is set to true, this value is not used.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_format</key>
			<string>https?://.*</string>
			<key>pfm_name</key>
			<string>passwordChangeURL</string>
			<key>pfm_title</key>
			<string>Password Change URL for Menu</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>xcreds://auth/</string>
			<key>pfm_description</key>
			<string>The URI passed back to the webview after successful authentication. Default value: xcreds://auth/</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>redirectURI</string>
			<key>pfm_title</key>
			<string>Redirect URI</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Determine if the Mac login window or the cloud login window is shown by default.  When not set or set to true, show cloud login. If false, shows Mac login.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowCloudLoginByDefault</string>
			<key>pfm_title</key>
			<string>Show Cloud Login By Default</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>3</integer>
			<key>pfm_description</key>
			<string>The number of hours between checks. Default value: 3. Minimum value: 0. Max value: 168.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>refreshRateHours</string>
			<key>pfm_range_max</key>
			<integer>168</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Password Change Check Rate Hours</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>hours</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>The number of minutes between checks. Default value: 0. Minimum value: 0. Max value: 59. This value is added to refreshRateHours. If refreshRateHours is 0, minimum for refreshRateMinutes becomes 5.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>refreshRateMinutes</string>
			<key>pfm_range_max</key>
			<integer>59</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Password Change Check Rate Minutes</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>profile openid offline_access</string>
			<key>pfm_description</key>
			<string>Scopes tell the identify provider what information to return. Note that the values are provided with a single space between them.

Provide the following values the follow IdPs:

Google: profile openid email
Azure: profile openid offline_access

Note that Google does not support the offline_access scope so instead use the preference shouldSetGoogleAccessTypeToOffline. Azure provides unique_name which is mapped to the local user account by using the prefix before "@" in unique_name and matching to the short name of a user account. Google provides "email" and is matched in the same way.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>scopes</string>
			<key>pfm_note</key>
			<string>All scopes should be lowercase and separated by single spaces</string>
			<key>pfm_title</key>
			<string>Scopes</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When using Google IdP, a refresh token may need be requested in a non-standard way.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldSetGoogleAccessTypeToOffline</string>
			<key>pfm_title</key>
			<string>Request Google Refresh Token</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If the domain controller returns back that the password is expired or needs to be changed, prompt the user. If this is set to false, login will fail and an error message will be shown.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldPromptForADPasswordChange</string>
			<key>pfm_title</key>
			<string>Should Prompt For AD Password Change</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Determine if the Sign In menu item is shown in the XCreds menu. When not set or set to true, show Sign In. If false, the Sign In menu item is hidden.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowSignInMenuItem</string>
			<key>pfm_title</key>
			<string>Show Sign In Menu Item</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.2</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Do not prompt for local password.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldSuppressLocalPasswordPrompt</string>
			<key>pfm_title</key>
			<string>Should Suppress Local Password Prompt</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Favor using XCreds' local login screen over the cloud login UI.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldPreferLocalLoginInsteadOfCloudLogin</string>
			<key>pfm_title</key>
			<string>Prefer Local Login over Cloud Login</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_max</key>
			<string>3.2.1</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>(Deprecated in v4.0) When verifying password in the menu app, use ROPG.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldVerifyPasswordWithRopg</string>
			<key>pfm_title</key>
			<string>Use ROPG when testing password</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When using ROPG, do basic HTTP auth. Default: false</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldUseBasicAuthWithROPG</string>
			<key>pfm_title</key>
			<string>Should Use Basic Auth With ROPG</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>3.2.1</string>
			<key>pfm_app_max</key>
			<string>3.2.1</string>
			<key>pfm_description</key>
			<string>(Removed in v4.0) ROPG Client ID for use when checking password.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>ropgClientID</string>
			<key>pfm_title</key>
			<string>ROPG Client ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>3.2.1</string>
			<key>pfm_app_max</key>
			<string>3.2.1</string>
			<key>pfm_description</key>
			<string>(Removed in v4.0) ROPG Client Secret for use when checking password.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>ropgClientSecret</string>
			<key>pfm_title</key>
			<string>ROPG Client Secret</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When verifying password in the login window, use ROPG.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldUseROPGForLoginWindowLogin</string>
			<key>pfm_title</key>
			<string>Use ROPG when logging in at login window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When verifying password in the menu app, use ROPG.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldUseROPGForMenuLogin</string>
			<key>pfm_title</key>
			<string>Use ROPG for menu login</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When verifying local password matches cloud password in the background, use ROPG. If set to false, the refresh token will be used to verify password change.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldUseROPGForPasswordChangeChecking</string>
			<key>pfm_title</key>
			<string>Should Use ROPG For Password Change Checking</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Resource URL when using ROPG. Typically needed only for Azure. Common value is https://graph.microsoft.com</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>resource</string>
			<key>pfm_title</key>
			<string>ROPG Resource</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.1</string>
			<key>pfm_default</key>
			<string>interaction_required</string>
			<key>pfm_description</key>
			<string>When a ROPG request is completed successfully to verify password, it may return an error that two factor is required. Add the string that is returned for the JSON response. For Azure, it is typically interaction_required. For Okta, the response is usually {"error":"invalid_grant","error_description":"Resource owner password credentials authentication denied by sign on policy."} Can be a string or an array of strings.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>ropgResponseValue</string>
			<key>pfm_title</key>
			<string>ROPG Response Value</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_description</key>
			<string>Don't show the UI if this key is defined and a file or folder exists at this path.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>hideIfPathExists</string>
			<key>pfm_title</key>
			<string>Hide If Path Exists</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_description</key>
			<string>Name of OIDC claim that contains an alias to add to a user account. Usually this is the "upn" (eg syd@twocanoes.com) so the user can log in at the standard login window the same as the IdP login window. Adds the value to record name of the user account as an alias.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>aliasName</string>
			<key>pfm_title</key>
			<string>Alias Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Timer for automatically refreshing login screen in seconds. If set to 0, does not automatically refresh.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>autoRefreshLoginTimer</string>
			<key>pfm_title</key>
			<string>Automatically Refresh Login Window (seconds)</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Cloud Login</string>
			<key>pfm_description</key>
			<string>Text for return to cloud login on Mac login screen</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>cloudLoginText</string>
			<key>pfm_title</key>
			<string>Cloud Login Text</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show the About Menu item menu. Default value: true</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowAboutMenu</string>
			<key>pfm_title</key>
			<string>Show About Menu</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skip filevault login during startup if filevault is enabled. The current username and password is used to tell fdesetup to use silently use the credentials during next reboot to unlock FileVault. Passthrough is also disabled and the user will see the XCreds Login Window. To avoid the user prompted for admin credentials, set the Login And Background Item Management management item (com.apple.servicemanagement) to allow teamid UXP6YEHSPW to have background tasks. Default value: false</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldSkipFileVaultLogin</string>
			<key>pfm_title</key>
			<string>Skip FileVault Login</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skip FileVault authentication at startup if filevault is enabled. The admin credentials will be used to tell fdesetup to use silently use the credentials during next reboot to unlock FileVault. Passthrough is also disabled and the user will see the XCreds Login Window. To avoid the user prompted for admin credentials, set the Login And Background Item Management management item (com.apple.servicemanagement) to allow teamid UXP6YEHSPW to have background tasks. Default value: false</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldSkipFileVaultLoginAdmin</string>
			<key>pfm_title</key>
			<string>Skip FileVault Login as Admin</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If the discovery URL is defined and there are no tokens or tickets, the sign in window in the user session will show even if the user did not log in from the XCreds Login Window</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowMenuBarSignInWithoutLoginWindowSignin</string>
			<key>pfm_title</key>
			<string>Should Show Menu Bar Sign In Without Login Window Sign In</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<string>Log in to verify your cloud credentials. After verification, your local user account password will be set to your cloud password.</string>
			<key>pfm_description</key>
			<string>Text at top of window shown in user session when prompting for password.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>refreshBannerText</string>
			<key>pfm_title</key>
			<string>Refresh Banner Text</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show text at the top of the prompt window when tokens expire.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowRefreshBanner</string>
			<key>pfm_title</key>
			<string>Show Refresh Banner</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show Configure WiFi button in XCreds Login.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowConfigureWifiButton</string>
			<key>pfm_title</key>
			<string>Show Configure WiFi</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show Shutdown button in XCreds Login.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowShutdownButton</string>
			<key>pfm_title</key>
			<string>Show Shutdown Button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show Restart button in XCreds Login.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowRestartButton</string>
			<key>pfm_title</key>
			<string>Show Restart Button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show Configure System Info in XCreds Login.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowSystemInfoButton</string>
			<key>pfm_title</key>
			<string>Show System Info Button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Show Settings on start if none are defined. Default value: false</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowPreferencesOnStart</string>
			<key>pfm_title</key>
			<string>Show Preferences on Startup</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prompt for local account username and password if no account was mapped and there are standard users already on the system.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldPromptForMigration</string>
			<key>pfm_title</key>
			<string>Should Prompt for Migration</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Allow key combo (control-option return) to switch logon window. Use command-option-control-return for Mac Login Window. </string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldAllowKeyComboForMacLoginWindow</string>
			<key>pfm_title</key>
			<string>Should Allow Key Combo For Mac Login Window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_description</key>
			<string>key code for shouldAllowKeyComboForMacLoginWindow. If not defined, it is return or enter. If this is defined, this key is used with control-option to switch to login window and command-option-control and this key is used to switch to Mac Login Window. Uses CGKeyCode (for example, enter is 76 and return is 36)</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>keyCodeForLoginWindowChange</string>
			<key>pfm_title</key>
			<string>Key Code For Login Window Change</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show the Mac Login Window button in XCreds Login.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowMacLoginButton</string>
			<key>pfm_title</key>
			<string>Show Mac Login Window button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show the local only checkbox on the local login page </string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowLocalOnlyCheckbox</string>
			<key>pfm_title</key>
			<string>Show Local Only Checkbox</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Placeholder text in local / AD login window for username</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>usernamePlaceholder</string>
			<key>pfm_title</key>
			<string>Username Placeholder Text</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Placeholder text in local / AD login window for password</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>passwordPlaceholder</string>
			<key>pfm_title</key>
			<string>Password Placeholder Text</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show message in XCreds Login reminding people to buy support.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowSupportStatus</string>
			<key>pfm_title</key>
			<string>Show Support Status Message</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Show Quit in the menu item menu. Default value: true</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowQuitMenu</string>
			<key>pfm_title</key>
			<string>Show Quit Menu Item</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>5.4</string>
			<key>pfm_app_max</key>
			<string>5.4</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>(Removed in v5.4 and replaced by shouldActivateSystemInfoButton) Show the version number and build number in the lower left corner of XCreds Login.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldShowVersionInfo</string>
			<key>pfm_title</key>
			<string>Show Version and Build Number</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Show push notifications for authentication progress. Default value: false</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>showDebug</string>
			<key>pfm_title</key>
			<string>Show Debug Message</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When a user uses cloud login, XCreds will try and figure out the local username based on the email or other data returned for the IdP. Use this value to force the local username for any cloud login. Provide only the shortname.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>username</string>
			<key>pfm_title</key>
			<string>Local Username</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>5.4</string>
			<key>pfm_app_max</key>
			<string>5.4</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When a local user password does not match the cloud or AD password, this key will allow the user to select a Reset button to set their password to match their AD/cloud password, move their current keychain aside and create a new keychain. If XCreds does not have access to local admin credentials set from the XCreds command line tools, the user will prompted to enter local admin credentials.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>KeychainReset</string>
			<key>pfm_title</key>
			<string>Keychain Reset</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Update the local user password silently to match the cloud / AD password. Requires access to admin credentials. See command line help to set admin username and password.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>PasswordOverwriteSilent</string>
			<key>pfm_title</key>
			<string>Overwrite Password Silently</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Hide AD Expiration even if defined in AD Account</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>HideExpiration</string>
			<key>pfm_title</key>
			<string>Hide Expiration</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Username of local admin user. DO NOT SET THIS IN PREFERENCES. It is recommended to set this with the settingsOverrideScriptPath script. This user is used to reset the keychain if the user forgets their local password and to setup a secure token for newly created users.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>localAdminUserName</string>
			<key>pfm_title</key>
			<string>Local Admin User Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Password of local admin user. DO NOT SET THIS IN PREFERENCES. It is recommended to set this with the settingsOverrideScriptPath script. This user is used to reset the keychain if the user forgets their local password and to setup a secure token for newly created users.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>localAdminPassword</string>
			<key>pfm_title</key>
			<string>Local Admin Password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<string>Unlock Account</string>
			<key>pfm_description</key>
			<string>Title of dialog prompting user to enter in their prior local password when account is locked.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>accountLockedPasswordDialogTitle</string>
			<key>pfm_title</key>
			<string>Account Locked Password Dialog Title</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.3</string>
			<key>pfm_default</key>
			<string>The user account is locked.  You can wait for the account to unlock or reset the password by clicking the Reset button below.</string>
			<key>pfm_description</key>
			<string>Text of dialog prompting user to enter in their prior local password when account is locked.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>accountLockedPasswordDialogText</string>
			<key>pfm_title</key>
			<string>Account Locked Password Dialog Text</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<string>Please enter your local login password to sync your cloud password and login.</string>
			<key>pfm_description</key>
			<string>Title of dialog prompting user to enter in their prior local password.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>resetPasswordDialogTitle</string>
			<key>pfm_title</key>
			<string>Reset Password Dialog Title</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<string>System Info</string>
			<key>pfm_description</key>
			<string>The title of the button for system info in the bottom right corner of the login screen. This can either be plain text or one of these special values: .os, .hostname, .ipaddress, .serial, .mac, .computername, .ssid. Using the special value will populate the associated information as the button title.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>systemInfoButtonTitle</string>
			<key>pfm_title</key>
			<string>System Info Button Title</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When cloud password is changed and the local keychain password and local user account needs to be changed, a verification dialog can be shown to verify the password. Default value: true</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>verifyPassword</string>
			<key>pfm_title</key>
			<string>Verify Cloud Password</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Check if network is up. If not, select username and password login window.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldDetectNetworkToDetermineLoginWindow</string>
			<key>pfm_title</key>
			<string>Should Detect Network To Determine Login Window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Hostname of the page that has the password field. When the user submits the form, XCreds will use idpHostName to identify a page it needs to look for the password field. The password value is identified by an HTML id defined by passwordElementID. If this value is not defined. XCreds will look for login.microsoftonline.com and accounts.google.com. This value is commonly set for other IdP’s and for Azure environments that use ADFS.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>idpHostName</string>
			<key>pfm_title</key>
			<string>IDP Host Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>array of hostnames of the page that has the password field.</string>
			<key>pfm_name</key>
			<string>idpHostNames</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>idpHostName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IDP Host Names</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.2</string>
			<key>pfm_description</key>
			<string>array of additional AD domains to accept</string>
			<key>pfm_name</key>
			<string>AdditionalADDomains</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Domain</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Additional AD Domains</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.2</string>
			<key>pfm_description</key>
			<string>Name of slot for CCID reader for reading RFID cards</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>ccidSlotName</string>
			<key>pfm_title</key>
			<string>CCID Slot Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.2</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If an unknown RFID card is tapped, show option to pair with local account.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shouldAllowLoginCardSetup</string>
			<key>pfm_title</key>
			<string>Should Allow Login Card Setup</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_description</key>
			<string>array of AD user attributes to add to local directory user account</string>
			<key>pfm_name</key>
			<string>adUserAttributesToAddToLocalUserAccount</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>userAttribute</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>AD User Attributes To Add To Local User Account</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Password element id of the html element that has the password. It is read by using JavaScript to get the value (for example, for Azure, the JavaScript document.getElementById('i0118').value is sent. If this default is not set, standard values for Azure and Google Cloud will be used. To find out this value, use a browser to inspect the source of the page that has the password on it. Find the id of the textfield that has the password. Fill in the password and then open the JavaScript console. Run:

document.getElementById('passwordID').value

changing "passwordID" to the correct element ID. If the value you typed into the textfield is returned, this is the correct ID.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>passwordElementID</string>
			<key>pfm_title</key>
			<string>Password Element ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>given_name</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC/AD Mapping for First Name. Default value: "given_name" (OIDC), "givenName" (AD). map_firstname should be set to an OIDC claim/AD Attribute for first name.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>map_firstname</string>
			<key>pfm_note</key>
			<string>Map firstName to OIDC claim/AD Attribute</string>
			<key>pfm_title</key>
			<string>First Name OIDC Mapping/AD Attribute</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>family_name</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC/AD Mapping for Last Name. Default value: "family_name" (OIDC), "sn" (AD). map_lastname should be set to an OIDC claim for last name.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>map_lastname</string>
			<key>pfm_note</key>
			<string>Map lastName to OIDC claim/AD Attribute</string>
			<key>pfm_title</key>
			<string>Last Name OIDC Mapping</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>name</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC/AD Attribute Mapping for Full Name. Default value: "name"(OIDC), "displayName" (AD). map_fullname should be set to an OIDC claim/AD Attribute for full name.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>map_fullname</string>
			<key>pfm_note</key>
			<string>Map fullName to OIDC claim/AD Attribute</string>
			<key>pfm_title</key>
			<string>Full Name OIDC Mapping/AD Attribute</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>name</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC Mapping/AD Attribute for Name. Default value: "name" (OIDC), "userPrincipalName" (AD). map_username should be set to an OIDC claim/AD Attribute for name. The macOS username will be set as the portion of this value before an @ symbol if present.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>map_username</string>
			<key>pfm_note</key>
			<string>Map Username to OIDC claim/AD Attribute</string>
			<key>pfm_title</key>
			<string>Username OIDC Mapping/AD Attribute</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<string>name</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC Mapping for Full Username (for example, freddy@twocanoes.com) Default value: "unique_name". map_username should be set to an OIDC claim for full username.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>map_fullusername</string>
			<key>pfm_note</key>
			<string>Map Full Username (user@domain) to OIDC claim/AD Attribute</string>
			<key>pfm_title</key>
			<string>Full Username OIDC Mapping/AD Attribute</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC Mapping/AD Attribute for UID at initial user creation. If not set, the uid will be set to the next available. If the mapped UID is used, login will fail.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>map_uid</string>
			<key>pfm_note</key>
			<string>Map UID to OIDC claim/AD Attribute</string>
			<key>pfm_title</key>
			<string>Map UID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.5</string>
			<key>pfm_default</key>
			<string>20</string>
			<key>pfm_description</key>
			<string>Primary Group ID when creating a new user. Default value 20.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>primaryGroupID</string>
			<key>pfm_title</key>
			<string>Primary Group ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<string>pwd_exp</string>
			<key>pfm_description</key>
			<string>Password expiry mapping to claim. If this value is set to an OIDC claim, the value in that claim should be the number of seconds from the token issued time (iat) to the expiry date. </string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>map_password_expiry</string>
			<key>pfm_note</key>
			<string>Map OIDC claim to Password Expiry Seconds</string>
			<key>pfm_title</key>
			<string>Map OIDC claim to Password Expiry in Seconds</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>name</string>
			<key>pfm_description</key>
			<string>Script to override defaults. Must return valid property list with specified defaults. Script must exist at path, be owned by _securityagent and writable and executable only by _securityagent.</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>settingsOverrideScriptPath</string>
			<key>pfm_title</key>
			<string>Override Script Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.2</string>
			<key>pfm_description</key>
			<string>In some Active Directory environments, users do not use username@domain to login; they use a UPN suffix to make the username easier to use. This setting maps the UPN suffix to the correct AD domain name. For example, if you have an AD domain of foo.com but want users to sign in as user@bar.com, a UPN suffix of foo.com is created in AD and the user account is set to user@foo.com. This setting then would map foo.com to bar.com by setting the key upn to foo.com and the domain key to bar.com.</string>
			<key>pfm_name</key>
			<string>upnSuffixToDomainMappings</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_hidden</key>
					<string>container</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>UPN</string>
							<key>pfm_name</key>
							<string>upn</string>
							<key>pfm_title</key>
							<string>UPN</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>domain</string>
							<key>pfm_name</key>
							<string>domain</string>
							<key>pfm_title</key>
							<string>domain</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>UPN Suffix To Domain Mappings</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Menu Items</string>
			<key>pfm_description_reference</key>
			<string>Optional Array of Additional Menu Items</string>
			<key>pfm_name</key>
			<string>menuItems</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Menu Item Name</string>
					<key>pfm_name</key>
					<string>menuItemName</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Menu Item</string>
							<key>pfm_name</key>
							<string>menuItemName</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Menu Item Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>Menu Item Name</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Link or App Path</string>
							<key>pfm_name</key>
							<string>linkOrAppPath</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Web page URL or local path to app</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>/System/Applications/Utilities/Keychain Access.app or http://twocanoes.com/info</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<false/>
							<key>pfm_description</key>
							<string>Separator line before menu item</string>
							<key>pfm_description_reference</key>
							<string>Add a line before menu item</string>
							<key>pfm_name</key>
							<string>separatorBefore</string>
							<key>pfm_title</key>
							<string>Separator Before</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<false/>
							<key>pfm_description</key>
							<string>Separator line after menu item</string>
							<key>pfm_description_reference</key>
							<string>Add a line after menu item</string>
							<key>pfm_name</key>
							<string>separatorAfter</string>
							<key>pfm_title</key>
							<string>Separator After</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Optional Menu Items</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Menu Items</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Add menu item and mount/automount shares</string>
			<key>pfm_name</key>
			<string>Shares</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Name of share to show in menu</string>
							<key>pfm_name</key>
							<string>Name</string>
							<key>pfm_title</key>
							<string>Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>URL for share (eg smb://server.example.com/share)</string>
							<key>pfm_name</key>
							<string>URL</string>
							<key>pfm_title</key>
							<string>URL</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>Groups</string>
							<key>pfm_title</key>
							<string>Groups</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Allow mounting only if network connection is detected</string>
							<key>pfm_name</key>
							<string>ConnectedOnly</string>
							<key>pfm_title</key>
							<string>ConnectedOnly</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Automatically mount when XCreds starts</string>
							<key>pfm_name</key>
							<string>AutoMount</string>
							<key>pfm_title</key>
							<string>AutoMount</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Shares</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show and mount home directory from AD profile if defined.</string>
			<key>pfm_name</key>
			<string>HomeMountEnabled</string>
			<key>pfm_title</key>
			<string>Home Mount Enabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Append the domain name to the share defined in the profile.</string>
			<key>pfm_name</key>
			<string>HomeAppendDomain</string>
			<key>pfm_title</key>
			<string>Home Append Domain</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Name for Shares menu item. Default: "Shares".</string>
			<key>pfm_documentation_url</key>
			<string>https://twocanoes.com/knowledge-base/xcreds-admin-guide/#preferences</string>
			<key>pfm_name</key>
			<string>shareMenuItemName</string>
			<key>pfm_title</key>
			<string>Share Menu Item Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>XCreds</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>15</integer>
</dict>
</plist>
